[{"albumId":"d4288701-0013-41a2-a6b3-beeff4baa0f3","artistName":"Cypress Hill","albumName":"Black Sunday","price":12.9,"tags":["West Coast Hip Hop","Gangsta Rap","Boom Bap","Latin Rap"],"stock":8,"description":"Black Sunday is the second studio album by American hip hop group Cypress Hill. It was released on July 20, 1993 by Ruffhouse and Columbia Records. The album proved to be a massive success just like the first album Cypress Hill. The album debuted at #1 on the US Billboard 200, selling 261,000 copies in its first week of sales and became the highest Soundscan recording for a hip hop group at the time. Also, with their first album (Cypress Hill) still in the charts, they became the first hip hop group ever to have 2 albums in the Top 10 of the US Billboard 200 at the same time. The album went Triple platinum in the U.S. with 3.4 million units sold."},{"albumId":"e7070245-6fb5-4799-b235-e4cb42062a46","artistName":"Cypress Hill","albumName":"IV","price":10.2,"tags":["West Coast Hip Hop","Gangsta Rap","Boom Bap","Latin Rap"],"stock":9,"description":"Cypress Hill IV is the fourth studio album by American hip hop group Cypress Hill. It was released on October 6, 1998 by Ruffhouse and Columbia Records. After 3 years from their previous album, Cypress Hill released the ‘IV’ album. The skeletons on the cover are posing as the three wise monkeys (see no evil, hear no evil, speak no evil). Rappers MC Eiht and Barron Ricks were featured on the album. The album went Gold[ in the U.S with over 500,000 units sold."},{"albumId":"412de3ae-b493-4f73-9c09-7df99a617145","artistName":"Eminem","albumName":"Marshall Mathers LP","price":14.7,"tags":["Pop Rap"," Hardcore Hip Hop","Hip Hop"],"stock":8,"description":"The Marshall Mathers LP is the third studio album by American rapper Eminem, released on May 23, 2000, by Aftermath Entertainment and Interscope Records. The album was produced mostly by Dr. Dre and Eminem, along with The 45 King, the Bass Brothers, and Mel-Man. Recorded over a two-month period in several studios around Detroit, the album features more introspective lyricism, including Eminem's thoughts on his rise from rags to riches, the criticism of his music, and his estrangement from his family and wife. A transgressive work, it incorporates horrorcore and hardcore hip hop, while also featuring satirical songs. Featured appearances include Dido, RBX, Sticky Fingaz, Bizarre, Snoop Dogg, Xzibit, Nate Dogg, and D12."},{"albumId":"7a971f0b-609d-4495-84ab-89d65a62fa51","artistName":"Slayer","albumName":"Reign in Blood","price":6.66,"tags":["Thrash Metal","Groove Metal","Hardcore Punk"],"stock":5,"description":"Reign in Blood is the third studio album by American thrash metal band Slayer, released on October 7, 1986, by Def Jam Recordings. The album was the band's first collaboration with producer Rick Rubin, whose input helped the band's sound evolve. The release date of the album was delayed because of concerns regarding the lyrical subject matter of the opening track \"Angel of Death\", which refers to Josef Mengele and describes acts such as human experimentation that he committed at the Auschwitz concentration camp. The band's members stated that they did not condone Nazism and were merely interested in the subject."},{"albumId":"25639b4d-8f0f-453d-83a6-ac0b1b60742c","artistName":"Children of Bodom","albumName":"Something Wild","price":9.99,"tags":["Melodic Death Metal","Power Metal"],"stock":6,"description":"Something Wild is the debut full-length album by Finnish melodic death metal band Children of Bodom, released in 1997 in Finland, and in 1998 worldwide. Upon release, the album was met with universal acclaim by music critics. In 2020, it was named one of the 20 best metal albums of 1997 by Metal Hammer magazine."},{"albumId":"37ed856a-c670-43fc-ab16-5dafe8c43a68","artistName":"Mariah Carey","albumName":"Merry Christmas","price":4.5,"tags":["Contemporary R&B"," Adult Contemporary","Pop"],"stock":1,"description":"Merry Christmas is the fourth studio album by American singer-songwriter Mariah Carey, and her first Christmas album. Released by Columbia Records on October 28, 1994, at the peak of the initial stretch of Carey's career, between Music Box (1993) and Daydream (1995), the album features cover versions of popular Christmas songs in addition to original material. Carey worked with Walter Afanasieff, with whom she wrote all of the original tracks, as well as producing Carey's interpretations of the covered material. Three singles were released from the album, of which \"All I Want for Christmas Is You\" went on to become one of the best-selling singles of all time and the best-selling Christmas ringtone in the United States."},{"albumId":"1b59aaf0-bc3d-422e-96cc-b78e2627981f","artistName":"Celine Dion","albumName":"My Heart Will Go On","price":7.33,"tags":["Adult Contemporary","Pop","French Pop"],"stock":2,"description":"\"My Heart Will Go On\" is a 1997 song recorded by the Canadian singer Celine Dion as the theme for the film Titanic. It was composed by James Horner, with lyrics by Will Jennings. It was produced by Horner, Walter Afanasieff and Simon Franglen. \"My Heart Will Go On\" was released as a single internationally on November 24, 1997, and was included on Dion's album Let's Talk About Love and the Titanic soundtrack."},{"albumId":"2815eeb4-ba47-4afe-945d-28ca0ea89c71","artistName":"Notorious BIG","albumName":"Born Again","price":8.76,"tags":["East Coast Hip Hop"," Gangsta Rap"," Boom Bap"],"stock":0,"description":"Born Again is the first posthumous compilation album by American rapper the Notorious B.I.G., released by Bad Boy Records and Arista Records on December 7, 1999. It is composed primarily of early recorded verses with newer beats and guest rappers."},{"albumId":"635bfe0e-0d5e-46ed-a83b-9c5b89f53f6c","artistName":"NAS","albumName":"Illmatic","price":15.2,"tags":["East Coast Hip Hop"," Boom Bap","Conscious Hip Hop"],"stock":2,"description":"Illmatic is the debut studio album by American rapper Nas. It was released on April 19, 1994, by Columbia Records. After signing with the label with the help of MC Serch, Nas recorded the album in 1992 and 1993 at Chung King Studios, D&D Recording, Battery Studios, and Unique Recording Studios in New York City. The album's production was handled by DJ Premier, Large Professor, Pete Rock, Q-Tip, L.E.S., and Nas himself. Styled as a hardcore hip hop album, Illmatic features multi-syllabic internal rhymes and inner-city narratives based on Nas' experiences growing up in the Queensbridge Houses in Queens, New York City."},{"albumId":"b7b15171-aed0-4866-b4b9-9fc6f53fefa9","artistName":"NAS","albumName":"It Was Written","price":13.44,"tags":["East Coast Hip Hop"," Boom Bap","Conscious Hip Hop"],"stock":5,"description":"It Was Written is the second studio album by American rapper Nas, released on July 2, 1996, by Columbia Records. After the modest commercial success of his debut album Illmatic (1994), Nas pursued a more polished, mainstream sound for It Was Written. Produced largely by Trackmasters, it departed from the debut's raw, underground aesthetic and embraced mafioso and gangsta themes. The recording also marked the first appearance of Nas's short-lived supergroup The Firm, featuring the rappers Foxy Brown, AZ, and Cormega."},{"albumId":"c8b773b5-f6f0-4063-aab9-0efb6ee73015","artistName":"NAS","albumName":"Stillmatic","price":20.2,"tags":["East Coast Hip Hop"," Boom Bap","Conscious Hip Hop"],"stock":0,"description":"Stillmatic is the fifth studio album by American rapper Nas, released on December 18, 2001, by Ill Will and Columbia Records. In contrast to his previous work's gangsta rap themes, the album contains socially conscious and philosophical themes similar to that of his 1994 debut Illmatic. Nas' lyrics address topics such as ghetto life, American politics, and his feud with rapper Jay-Z."},{"albumId":"0ace393c-ddce-40b9-b911-3bfc58517619","artistName":"Horna","albumName":"Sudentaival","price":11.8,"tags":["Black Metal"],"stock":5,"description":"Sudentaival is the third full-length studio album by the black metal band Horna. Roughly translated, sudentaival means \"the wolf's path\". It was released in 2001 by Woodcut Records. An LP version was later released by Sombre Records and was limited to 350 copies. The South American version includes two bonus tracks, \"Koston Talvi\" and \"Voitonmalja\". These were the very first tracks done with Corvus."},{"albumId":"f605ecb4-8112-40f1-9f4e-e2ec6cf7915f","artistName":"Iron Maiden","albumName":"Killers","price":13.1,"tags":["Heavy Metal","NWOBHM","Progressive Metal"],"stock":8,"description":"Killers is the second studio album by English heavy metal band Iron Maiden. It was first released on 16 February 1981 in the United Kingdom by EMI Records and on 11 May in the United States by Harvest and Capitol Records. The album was their first with guitarist Adrian Smith, and their last with vocalist Paul Di'Anno, who was fired after problems with his stage performances arose due to his alcohol and cocaine use. Killers was also the first Iron Maiden album recorded with producer Martin Birch, who went on to produce their next eight albums until Fear of the Dark (1992)."},{"albumId":"149e1e0e-1cb2-4820-8a36-77eb25b558df","artistName":"Iron Maiden","albumName":"Powerslave","price":8.9,"tags":["Heavy Metal","NWOBHM","Progressive Metal"],"stock":1,"description":"Powerslave is the fifth studio album by the English heavy metal band Iron Maiden, released on 3 September 1984 through EMI Records in Europe and its sister label Capitol Records in North America. It was re-released by Sanctuary and Columbia Records in the United States in 2002."},{"albumId":"6f3870d0-3a5b-45ae-874d-9017bf0eac64","artistName":"Alice in Chains","albumName":"Dirt","price":5.98,"tags":["Grunge","Alternative Metal","Acoustic Rock"],"stock":0,"description":"Dirt is the second studio album by the American rock band Alice in Chains, released on September 29, 1992, through Columbia Records. Peaking at No. 6 on the Billboard 200 chart, the album received critical acclaim and is considered a classic in the grunge genre. It has since been certified 5x Platinum by the RIAA, making Dirt the band's highest selling album to date."},{"albumId":"6ee346c2-1f3f-47ab-aba1-830683dd44b2","artistName":"Nightwish","albumName":"Over the Hills and Far Away","price":16.7,"tags":["Symphonic Metal","Power Metal","Film Score"],"stock":6,"description":"Over the Hills and Far Away is the first EP by Finnish symphonic metal band Nightwish, released on 25 June 2001 through Spinefarm Records in Finland, and Drakkar Records in the rest of Europe. It was also released by Toy's Factory in Japan and Century Media Records in the US. Bassist Sami Vänskä left the band after its recording, due to musical differences between him and Tuomas Holopainen. He was replaced by the bassist and male vocalist, Marko Hietala."},{"albumId":"32cdecf1-8f81-4bfe-b173-f2c729b2474d","artistName":"Snoop Dogg","albumName":"The Doggfather","price":4.1,"tags":["West Coast Hip Hop","G-Funk","Contemporary R&B"],"stock":8,"description":"Tha Doggfather is the second studio album by American rapper Snoop Doggy Dogg. It was released on November 12, 1996, by Death Row and Interscope Records. After the success of his debut album Doggystyle (1993), Snoop was arrested and charged with murder and in 1995, spent time preparing for the case that went to trial."},{"albumId":"445e082e-2e2b-49f8-bedb-05ff24fafc20","artistName":"Notkea Rotta","albumName":"Itä meidän","price":8.99,"tags":["Hip Hop"],"stock":0,"description":"Itä meidän on hip hop-yhtye Notkean Rotan toinen albumi, jonka julkaisi Monsp Records 2005. Albumi oli yhden viikon Suomen virallisella albumilistalla nousten sijalle 16. Levy julkaistiin CD- (MONSP024) ja vinyyliformaatissa (MONSP1224). Ilmansuunta albumin nimessä viittaa Itä-Helsinkiin, jonne monet yhtyeen tarinat sijoittuvat."},{"albumId":"771c720b-8b84-45ce-b32f-17877e006cb7","artistName":"Afroman","albumName":"My Fro-losophy","price":19.9,"tags":["Comedy Rap","West Coast Hip Hop","Novelty"],"stock":0,"description":"Firt album of Joseph Edgar Foreman (born July 28, 1974). He is better known by his stage name Afroman, is an American political activist, rapper, singer, songwriter, comedian and musician. He is best known for his songs \"Because I Got High\", released in 2000, and \"Crazy Rap\", which was released in 2001 and both were featured on his album The Good Times. Afroman was nominated for a Grammy award in 2002. He is currently running for President in the 2024 United States presidential election as an Independent."},{"albumId":"344c6790-ec18-4b79-9142-2cda9fffcbdd","artistName":"Lady Gaga","albumName":"The Fame Monster","price":16.66,"tags":["Dance-Pop","Electropop","Euro House"],"stock":2,"description":"The Fame Monster is a reissue of American singer Lady Gaga's debut studio album, The Fame (2008), and was released on November 18, 2009, through Interscope Records. Initially planned solely as a deluxe edition reissue of The Fame, Interscope later decided to release the eight new songs as a standalone EP in some territories. The decision was also because Gaga believed the re-release was too expensive and that the albums were conceptually different, describing them as yin and yang."}]
